ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR128DB48def.inc
.equ AC0_base = 0x0680                   ; Analog Comparator
.equ AC1_base = 0x0688                   ; Analog Comparator
.equ AC2_base = 0x0690                   ; Analog Comparator
.equ ADC0_base = 0x0600                  ; Analog to Digital Converter
.equ BOD_base = 0x00A0                   ; Bod interface
.equ CCL_base = 0x01C0                   ; Configurable Custom Logic
.equ CLKCTRL_base = 0x0060               ; Clock controller
.equ CPU_base = 0x0030                   ; CPU
.equ CPUINT_base = 0x0110                ; Interrupt Controller
.equ CRCSCAN_base = 0x0120               ; CRCSCAN
.equ DAC0_base = 0x06A0                  ; Digital to Analog Converter
.equ EVSYS_base = 0x0200                 ; Event System
.equ FUSE_base = 0x1050                  ; Fuses
.equ GPR_base = 0x001C                   ; General Purpose Registers
.equ LOCK_base = 0x1040                  ; Lockbits
.equ MVIO_base = 0x00C0                  ; Multi-Voltage I/O
.equ NVMCTRL_base = 0x1000               ; Non-volatile Memory Controller
.equ OPAMP_base = 0x0700                 ; Operational Amplifier System
.equ PORTA_base = 0x0400                 ; I/O Ports
.equ PORTB_base = 0x0420                 ; I/O Ports
.equ PORTC_base = 0x0440                 ; I/O Ports
.equ PORTD_base = 0x0460                 ; I/O Ports
.equ PORTE_base = 0x0480                 ; I/O Ports
.equ PORTF_base = 0x04A0                 ; I/O Ports
.equ PORTMUX_base = 0x05E0               ; Port Multiplexer
.equ RSTCTRL_base = 0x0040               ; Reset controller
.equ RTC_base = 0x0140                   ; Real-Time Counter
.equ SIGROW_base = 0x1100                ; Signature row
.equ SLPCTRL_base = 0x0050               ; Sleep Controller
.equ SPI0_base = 0x0940                  ; Serial Peripheral Interface
.equ SPI1_base = 0x0960                  ; Serial Peripheral Interface
.equ SYSCFG_base = 0x0F00                ; System Configuration Registers
.equ TCA0_base = 0x0A00                  ; 16-bit Timer/Counter Type A
.equ TCA1_base = 0x0A40                  ; 16-bit Timer/Counter Type A
.equ TCB0_base = 0x0B00                  ; 16-bit Timer Type B
.equ TCB1_base = 0x0B10                  ; 16-bit Timer Type B
.equ TCB2_base = 0x0B20                  ; 16-bit Timer Type B
.equ TCB3_base = 0x0B30                  ; 16-bit Timer Type B
.equ TCD0_base = 0x0B80                  ; Timer Counter D
.equ TWI0_base = 0x0900                  ; Two-Wire Interface
.equ TWI1_base = 0x0920                  ; Two-Wire Interface
.equ USART0_base = 0x0800                ; Universal Synchronous and Asynchronous Receiver and Transmitter
.equ USART1_base = 0x0820                ; Universal Synchronous and Asynchronous Receiver and Transmitter
.equ USART2_base = 0x0840                ; Universal Synchronous and Asynchronous Receiver and Transmitter
.equ USART3_base = 0x0860                ; Universal Synchronous and Asynchronous Receiver and Transmitter
.equ USART4_base = 0x0880                ; Universal Synchronous and Asynchronous Receiver and Transmitter
.equ USERROW_base = 0x1080               ; User Row
.equ VPORTA_base = 0x0000                ; Virtual Ports
.equ VPORTB_base = 0x0004                ; Virtual Ports
.equ VPORTC_base = 0x0008                ; Virtual Ports
.equ VPORTD_base = 0x000C                ; Virtual Ports
.equ VPORTE_base = 0x0010                ; Virtual Ports
.equ VPORTF_base = 0x0014                ; Virtual Ports
.equ VREF_base = 0x00B0                  ; Voltage reference
.equ WDT_base = 0x0100                   ; Watch-Dog Timer
.equ ZCD0_base = 0x06C0                  ; Zero Cross Detect
.equ ZCD1_base = 0x06C8                  ; Zero Cross Detect
.equ ZCD2_base = 0x06D0                  ; Zero Cross Detect


; ***** IO REGISTER OFFSETS **********************************************


;*************************************************************************
;** AC - Analog Comparator
;*************************************************************************
.equ AC_CTRLA_offset = 0x00              ; Control A
.equ AC_CTRLB_offset = 0x01              ; Control B
.equ AC_MUXCTRL_offset = 0x02            ; Mux Control A
.equ AC_DACREF_offset = 0x05             ; DAC Voltage Reference
.equ AC_INTCTRL_offset = 0x06            ; Interrupt Control
.equ AC_STATUS_offset = 0x07             ; Status

;*************************************************************************
;** ADC - Analog to Digital Converter
;*************************************************************************
.equ ADC_CTRLA_offset = 0x00             ; Control A
.equ ADC_CTRLB_offset = 0x01             ; Control B
.equ ADC_CTRLC_offset = 0x02             ; Control C
.equ ADC_CTRLD_offset = 0x03             ; Control D
.equ ADC_CTRLE_offset = 0x04             ; Control E
.equ ADC_SAMPCTRL_offset = 0x05          ; Sample Control
.equ ADC_MUXPOS_offset = 0x08            ; Positive mux input
.equ ADC_MUXNEG_offset = 0x09            ; Negative mux input
.equ ADC_COMMAND_offset = 0x0A           ; Command
.equ ADC_EVCTRL_offset = 0x0B            ; Event Control
.equ ADC_INTCTRL_offset = 0x0C           ; Interrupt Control
.equ ADC_INTFLAGS_offset = 0x0D          ; Interrupt Flags
.equ ADC_DBGCTRL_offset = 0x0E           ; Debug Control
.equ ADC_TEMP_offset = 0x0F              ; Temporary Data
.equ ADC_RES_offset = 0x10               ; ADC Accumulator Result
.equ ADC_WINLT_offset = 0x12             ; Window comparator low threshold
.equ ADC_WINHT_offset = 0x14             ; Window comparator high threshold

;*************************************************************************
;** BOD - Bod interface
;*************************************************************************
.equ BOD_CTRLA_offset = 0x00             ; Control A
.equ BOD_CTRLB_offset = 0x01             ; Control B
.equ BOD_VLMCTRLA_offset = 0x08          ; Voltage level monitor Control
.equ BOD_INTCTRL_offset = 0x09           ; Voltage level monitor interrupt Control
.equ BOD_INTFLAGS_offset = 0x0A          ; Voltage level monitor interrupt Flags
.equ BOD_STATUS_offset = 0x0B            ; Voltage level monitor status

;*************************************************************************
;** CCL - Configurable Custom Logic
;*************************************************************************
.equ CCL_CTRLA_offset = 0x00             ; Control Register A
.equ CCL_SEQCTRL0_offset = 0x01          ; Sequential Control 0
.equ CCL_SEQCTRL1_offset = 0x02          ; Sequential Control 1
.equ CCL_SEQCTRL2_offset = 0x03          ; Sequential Control 2
.equ CCL_INTCTRL0_offset = 0x05          ; Interrupt Control 0
.equ CCL_INTCTRL1_offset = 0x06          ; Interrupt Control 1
.equ CCL_INTFLAGS_offset = 0x07          ; Interrupt Flags
.equ CCL_LUT0CTRLA_offset = 0x08         ; LUT 0 Control A
.equ CCL_LUT0CTRLB_offset = 0x09         ; LUT 0 Control B
.equ CCL_LUT0CTRLC_offset = 0x0A         ; LUT 0 Control C
.equ CCL_TRUTH0_offset = 0x0B            ; Truth 0
.equ CCL_LUT1CTRLA_offset = 0x0C         ; LUT 1 Control A
.equ CCL_LUT1CTRLB_offset = 0x0D         ; LUT 1 Control B
.equ CCL_LUT1CTRLC_offset = 0x0E         ; LUT 1 Control C
.equ CCL_TRUTH1_offset = 0x0F            ; Truth 1
.equ CCL_LUT2CTRLA_offset = 0x10         ; LUT 2 Control A
.equ CCL_LUT2CTRLB_offset = 0x11         ; LUT 2 Control B
.equ CCL_LUT2CTRLC_offset = 0x12         ; LUT 2 Control C
.equ CCL_TRUTH2_offset = 0x13            ; Truth 2
.equ CCL_LUT3CTRLA_offset = 0x14         ; LUT 3 Control A
.equ CCL_LUT3CTRLB_offset = 0x15         ; LUT 3 Control B
.equ CCL_LUT3CTRLC_offset = 0x16         ; LUT 3 Control C
.equ CCL_TRUTH3_offset = 0x17            ; Truth 3
.equ CCL_LUT4CTRLA_offset = 0x18         ; LUT 4 Control A
.equ CCL_LUT4CTRLB_offset = 0x19         ; LUT 4 Control B
.equ CCL_LUT4CTRLC_offset = 0x1A         ; LUT 4 Control C
.equ CCL_TRUTH4_offset = 0x1B            ; Truth 4
.equ CCL_LUT5CTRLA_offset = 0x1C         ; LUT 5 Control A
.equ CCL_LUT5CTRLB_offset = 0x1D         ; LUT 5 Control B
.equ CCL_LUT5CTRLC_offset = 0x1E         ; LUT 5 Control C
.equ CCL_TRUTH5_offset = 0x1F            ; Truth 5

;*************************************************************************
;** CLKCTRL - Clock controller
;*************************************************************************
.equ CLKCTRL_MCLKCTRLA_offset = 0x00     ; MCLK Control A
.equ CLKCTRL_MCLKCTRLB_offset = 0x01     ; MCLK Control B
.equ CLKCTRL_MCLKCTRLC_offset = 0x02     ; MCLK Control C
.equ CLKCTRL_MCLKINTCTRL_offset = 0x03   ; MCLK Interrupt Control
.equ CLKCTRL_MCLKINTFLAGS_offset = 0x04  ; MCLK Interrupt Flags
.equ CLKCTRL_MCLKSTATUS_offset = 0x05    ; MCLK Status
.equ CLKCTRL_OSCHFCTRLA_offset = 0x08    ; OSCHF Control A
.equ CLKCTRL_OSCHFTUNE_offset = 0x09     ; OSCHF Tune
.equ CLKCTRL_PLLCTRLA_offset = 0x10      ; PLL Control A
.equ CLKCTRL_OSC32KCTRLA_offset = 0x18   ; OSC32K Control A
.equ CLKCTRL_XOSC32KCTRLA_offset = 0x1C  ; XOSC32K Control A
.equ CLKCTRL_XOSCHFCTRLA_offset = 0x20   ; 

;*************************************************************************
;** CPU - CPU
;*************************************************************************
.equ CPU_CCP_offset = 0x04               ; Configuration Change Protection
.equ CPU_RAMPZ_offset = 0x0B             ; Extended Z-pointer Register
.equ CPU_SP_offset = 0x0D                ; Stack Pointer
.equ CPU_SREG_offset = 0x0F              ; Status Register

;*************************************************************************
;** CPUINT - Interrupt Controller
;*************************************************************************
.equ CPUINT_CTRLA_offset = 0x00          ; Control A
.equ CPUINT_STATUS_offset = 0x01         ; Status
.equ CPUINT_LVL0PRI_offset = 0x02        ; Interrupt Level 0 Priority
.equ CPUINT_LVL1VEC_offset = 0x03        ; Interrupt Level 1 Priority Vector

;*************************************************************************
;** CRCSCAN - CRCSCAN
;*************************************************************************
.equ CRCSCAN_CTRLA_offset = 0x00         ; Control A
.equ CRCSCAN_CTRLB_offset = 0x01         ; Control B
.equ CRCSCAN_STATUS_offset = 0x02        ; Status

;*************************************************************************
;** DAC - Digital to Analog Converter
;*************************************************************************
.equ DAC_CTRLA_offset = 0x00             ; Control Register A
.equ DAC_DATA_offset = 0x02              ; DATA Register

;*************************************************************************
;** EVSYS - Event System
;*************************************************************************
.equ EVSYS_SWEVENTA_offset = 0x00        ; Software Event A
.equ EVSYS_SWEVENTB_offset = 0x01        ; Software Event B
.equ EVSYS_CHANNEL0_offset = 0x10        ; Multiplexer Channel 0
.equ EVSYS_CHANNEL1_offset = 0x11        ; Multiplexer Channel 1
.equ EVSYS_CHANNEL2_offset = 0x12        ; Multiplexer Channel 2
.equ EVSYS_CHANNEL3_offset = 0x13        ; Multiplexer Channel 3
.equ EVSYS_CHANNEL4_offset = 0x14        ; Multiplexer Channel 4
.equ EVSYS_CHANNEL5_offset = 0x15        ; Multiplexer Channel 5
.equ EVSYS_CHANNEL6_offset = 0x16        ; Multiplexer Channel 6
.equ EVSYS_CHANNEL7_offset = 0x17        ; Multiplexer Channel 7
.equ EVSYS_CHANNEL8_offset = 0x18        ; Multiplexer Channel 8
.equ EVSYS_CHANNEL9_offset = 0x19        ; Multiplexer Channel 9
.equ EVSYS_USERCCLLUT0A_offset = 0x20    ; User 0 - CCL0 Event A
.equ EVSYS_USERCCLLUT0B_offset = 0x21    ; User 1 - CCL0 Event B
.equ EVSYS_USERCCLLUT1A_offset = 0x22    ; User 2 - CCL1 Event A
.equ EVSYS_USERCCLLUT1B_offset = 0x23    ; User 3 - CCL1 Event B
.equ EVSYS_USERCCLLUT2A_offset = 0x24    ; User 4 - CCL2 Event A
.equ EVSYS_USERCCLLUT2B_offset = 0x25    ; User 5 - CCL2 Event B
.equ EVSYS_USERCCLLUT3A_offset = 0x26    ; User 6 - CCL3 Event A
.equ EVSYS_USERCCLLUT3B_offset = 0x27    ; User 7 - CCL3 Event B
.equ EVSYS_USERCCLLUT4A_offset = 0x28    ; User 8 - CCL4 Event A
.equ EVSYS_USERCCLLUT4B_offset = 0x29    ; User 9 - CCL4 Event B
.equ EVSYS_USERCCLLUT5A_offset = 0x2A    ; User 10 - CCL5 Event A
.equ EVSYS_USERCCLLUT5B_offset = 0x2B    ; User 11 - CCL5 Event B
.equ EVSYS_USERADC0START_offset = 0x2C   ; User 12 - ADC0
.equ EVSYS_USEREVSYSEVOUTA_offset = 0x2D ; User 13 - EVOUTA
.equ EVSYS_USEREVSYSEVOUTB_offset = 0x2E ; User 14 - EVOUTB
.equ EVSYS_USEREVSYSEVOUTC_offset = 0x2F ; User 15 - EVOUTC
.equ EVSYS_USEREVSYSEVOUTD_offset = 0x30 ; User 16 - EVOUTD
.equ EVSYS_USEREVSYSEVOUTE_offset = 0x31 ; User 17 - EVOUTE
.equ EVSYS_USEREVSYSEVOUTF_offset = 0x32 ; User 18 - EVOUTF
.equ EVSYS_USERUSART0IRDA_offset = 0x34  ; User 20 - USART0
.equ EVSYS_USERUSART1IRDA_offset = 0x35  ; User 21 - USART1
.equ EVSYS_USERUSART2IRDA_offset = 0x36  ; User 22 - USART2
.equ EVSYS_USERUSART3IRDA_offset = 0x37  ; User 23 - USART3
.equ EVSYS_USERUSART4IRDA_offset = 0x38  ; User 24 - USART4
.equ EVSYS_USERTCA0CNTA_offset = 0x3A    ; User 26 - TCA0 Event A
.equ EVSYS_USERTCA0CNTB_offset = 0x3B    ; User 27 - TCA0 Event B
.equ EVSYS_USERTCA1CNTA_offset = 0x3C    ; User 28 - TCA1 Event A
.equ EVSYS_USERTCA1CNTB_offset = 0x3D    ; User 29 - TCA1 Event B
.equ EVSYS_USERTCB0CAPT_offset = 0x3E    ; User 30 - TCB0 Event A
.equ EVSYS_USERTCB0COUNT_offset = 0x3F   ; User 31 - TCB0 Event B
.equ EVSYS_USERTCB1CAPT_offset = 0x40    ; User 32 - TCB1 Event A
.equ EVSYS_USERTCB1COUNT_offset = 0x41   ; User 33 - TCB1 Event B
.equ EVSYS_USERTCB2CAPT_offset = 0x42    ; User 34 - TCB2 Event A
.equ EVSYS_USERTCB2COUNT_offset = 0x43   ; User 35 - TCB2 Event B
.equ EVSYS_USERTCB3CAPT_offset = 0x44    ; User 36 - TCB3 Event A
.equ EVSYS_USERTCB3COUNT_offset = 0x45   ; User 37 - TCB3 Event B
.equ EVSYS_USERTCD0INPUTA_offset = 0x48  ; User 40 - TCD0 Event A
.equ EVSYS_USERTCD0INPUTB_offset = 0x49  ; User 41 - TCD0 Event B
.equ EVSYS_USEROPAMP0ENABLE_offset = 0x4A ; User 42 - OPAMP0 Enable
.equ EVSYS_USEROPAMP0DISABLE_offset = 0x4B ; User 43 - OPAMP0 Disable
.equ EVSYS_USEROPAMP0DUMP_offset = 0x4C  ; User 44 - OPAMP0 Dump
.equ EVSYS_USEROPAMP0DRIVE_offset = 0x4D ; User 45 - OPAMP0 Drive
.equ EVSYS_USEROPAMP1ENABLE_offset = 0x4E ; User 46 - OPAMP1 Enable
.equ EVSYS_USEROPAMP1DISABLE_offset = 0x4F ; User 47 - OPAMP1 Disable
.equ EVSYS_USEROPAMP1DUMP_offset = 0x50  ; User 48 - OPAMP1 Dump
.equ EVSYS_USEROPAMP1DRIVE_offset = 0x51 ; User 49 - OPAMP1 Drive
.equ EVSYS_USEROPAMP2ENABLE_offset = 0x52 ; User 50 - OPAMP2 Enable
.equ EVSYS_USEROPAMP2DISABLE_offset = 0x53 ; User 51 - OPAMP2 Disable
.equ EVSYS_USEROPAMP2DUMP_offset = 0x54  ; User 52 - OPAMP2 Dump
.equ EVSYS_USEROPAMP2DRIVE_offset = 0x55 ; User 53 - OPAMP2 Drive

;*************************************************************************
;** FUSE - Fuses
;*************************************************************************
.equ FUSE_WDTCFG_offset = 0x00           ; Watchdog Configuration
.equ FUSE_BODCFG_offset = 0x01           ; BOD Configuration
.equ FUSE_OSCCFG_offset = 0x02           ; Oscillator Configuration
.equ FUSE_SYSCFG0_offset = 0x05          ; System Configuration 0
.equ FUSE_SYSCFG1_offset = 0x06          ; System Configuration 1
.equ FUSE_CODESIZE_offset = 0x07         ; Code Section Size
.equ FUSE_BOOTSIZE_offset = 0x08         ; Boot Section Size

;*************************************************************************
;** GPR - General Purpose Registers
;*************************************************************************
.equ GPR_GPR0_offset = 0x00              ; General Purpose Register 0
.equ GPR_GPR1_offset = 0x01              ; General Purpose Register 1
.equ GPR_GPR2_offset = 0x02              ; General Purpose Register 2
.equ GPR_GPR3_offset = 0x03              ; General Purpose Register 3

;*************************************************************************
;** LOCK - Lockbits
;*************************************************************************
.equ LOCK_KEY_offset = 0x00              ; Lock Key Bits

;*************************************************************************
;** MVIO - Multi-Voltage I/O
;*************************************************************************
.equ MVIO_INTCTRL_offset = 0x00          ; Interrupt Control
.equ MVIO_INTFLAGS_offset = 0x01         ; Interrupt Flags
.equ MVIO_STATUS_offset = 0x02           ; Status

;*************************************************************************
;** NVMCTRL - Non-volatile Memory Controller
;*************************************************************************
.equ NVMCTRL_CTRLA_offset = 0x00         ; Control A
.equ NVMCTRL_CTRLB_offset = 0x01         ; Control B
.equ NVMCTRL_STATUS_offset = 0x02        ; Status
.equ NVMCTRL_INTCTRL_offset = 0x03       ; Interrupt Control
.equ NVMCTRL_INTFLAGS_offset = 0x04      ; Interrupt Flags
.equ NVMCTRL_DATA_offset = 0x06          ; Data
.equ NVMCTRL_ADDR_offset = 0x08          ; Address

;*************************************************************************
;** OPAMP - Operational Amplifier System
;*************************************************************************
.equ OPAMP_CTRLA_offset = 0x00           ; Control A
.equ OPAMP_DBGCTRL_offset = 0x01         ; Debug Control
.equ OPAMP_TIMEBASE_offset = 0x02        ; Timebase Value
.equ OPAMP_PWRCTRL_offset = 0x0F         ; Power Control
.equ OPAMP_OP0CTRLA_offset = 0x10        ; Op Amp 0 Control A
.equ OPAMP_OP0STATUS_offset = 0x11       ; Op Amp 0 Status
.equ OPAMP_OP0RESMUX_offset = 0x12       ; Op Amp 0 Resistor Ladder Multiplexer
.equ OPAMP_OP0INMUX_offset = 0x13        ; Op Amp 0 Input Multiplexer
.equ OPAMP_OP0SETTLE_offset = 0x14       ; Op Amp 0 Settle
.equ OPAMP_OP0CAL_offset = 0x15          ; Op Amp 0 Calibration
.equ OPAMP_OP1CTRLA_offset = 0x18        ; Op Amp 1 Control A
.equ OPAMP_OP1STATUS_offset = 0x19       ; Op Amp 1 Status
.equ OPAMP_OP1RESMUX_offset = 0x1A       ; Op Amp 1 Resistor Ladder Multiplexer
.equ OPAMP_OP1INMUX_offset = 0x1B        ; Op Amp 1 Input Multiplexer
.equ OPAMP_OP1SETTLE_offset = 0x1C       ; Op Amp 1 Settle
.equ OPAMP_OP1CAL_offset = 0x1D          ; Op Amp 1 Calibration
.equ OPAMP_OP2CTRLA_offset = 0x20        ; Op Amp 2 Control A
.equ OPAMP_OP2STATUS_offset = 0x21       ; Op Amp 2 Status
.equ OPAMP_OP2RESMUX_offset = 0x22       ; Op Amp 2 Resistor Ladder Multiplexer
.equ OPAMP_OP2INMUX_offset = 0x23        ; Op Amp 2 Input Multiplexer
.equ OPAMP_OP2SETTLE_offset = 0x24       ; Op Amp 2 Settle
.equ OPAMP_OP2CAL_offset = 0x25          ; Op Amp 2 Calibration

;*************************************************************************
;** PORT - I/O Ports
;*************************************************************************
.equ PORT_DIR_offset = 0x00              ; Data Direction
.equ PORT_DIRSET_offset = 0x01           ; Data Direction Set
.equ PORT_DIRCLR_offset = 0x02           ; Data Direction Clear
.equ PORT_DIRTGL_offset = 0x03           ; Data Direction Toggle
.equ PORT_OUT_offset = 0x04              ; Output Value
.equ PORT_OUTSET_offset = 0x05           ; Output Value Set
.equ PORT_OUTCLR_offset = 0x06           ; Output Value Clear
.equ PORT_OUTTGL_offset = 0x07           ; Output Value Toggle
.equ PORT_IN_offset = 0x08               ; Input Value
.equ PORT_INTFLAGS_offset = 0x09         ; Interrupt Flags
.equ PORT_PORTCTRL_offset = 0x0A         ; Port Control
.equ PORT_PINCONFIG_offset = 0x0B        ; Pin Control Config
.equ PORT_PINCTRLUPD_offset = 0x0C       ; Pin Control Update
.equ PORT_PINCTRLSET_offset = 0x0D       ; Pin Control Set
.equ PORT_PINCTRLCLR_offset = 0x0E       ; Pin Control Clear
.equ PORT_PIN0CTRL_offset = 0x10         ; Pin 0 Control
.equ PORT_PIN1CTRL_offset = 0x11         ; Pin 1 Control
.equ PORT_PIN2CTRL_offset = 0x12         ; Pin 2 Control
.equ PORT_PIN3CTRL_offset = 0x13         ; Pin 3 Control
.equ PORT_PIN4CTRL_offset = 0x14         ; Pin 4 Control
.equ PORT_PIN5CTRL_offset = 0x15         ; Pin 5 Control
.equ PORT_PIN6CTRL_offset = 0x16         ; Pin 6 Control
.equ PORT_PIN7CTRL_offset = 0x17         ; Pin 7 Control

;*************************************************************************
;** PORTMUX - Port Multiplexer
;*************************************************************************
.equ PORTMUX_EVSYSROUTEA_offset = 0x00   ; EVSYS route A
.equ PORTMUX_CCLROUTEA_offset = 0x01     ; CCL route A
.equ PORTMUX_USARTROUTEA_offset = 0x02   ; USART route A
.equ PORTMUX_USARTROUTEB_offset = 0x03   ; USART route B
.equ PORTMUX_SPIROUTEA_offset = 0x04     ; SPI route A
.equ PORTMUX_TWIROUTEA_offset = 0x05     ; TWI route A
.equ PORTMUX_TCAROUTEA_offset = 0x06     ; TCA route A
.equ PORTMUX_TCBROUTEA_offset = 0x07     ; TCB route A
.equ PORTMUX_TCDROUTEA_offset = 0x08     ; TCD route A
.equ PORTMUX_ACROUTEA_offset = 0x09      ; AC route A
.equ PORTMUX_ZCDROUTEA_offset = 0x0A     ; ZCD route A

;*************************************************************************
;** RSTCTRL - Reset controller
;*************************************************************************
.equ RSTCTRL_RSTFR_offset = 0x00         ; Reset Flags
.equ RSTCTRL_SWRR_offset = 0x01          ; Software Reset

;*************************************************************************
;** RTC - Real-Time Counter
;*************************************************************************
.equ RTC_CTRLA_offset = 0x00             ; Control A
.equ RTC_STATUS_offset = 0x01            ; Status
.equ RTC_INTCTRL_offset = 0x02           ; Interrupt Control
.equ RTC_INTFLAGS_offset = 0x03          ; Interrupt Flags
.equ RTC_TEMP_offset = 0x04              ; Temporary
.equ RTC_DBGCTRL_offset = 0x05           ; Debug control
.equ RTC_CALIB_offset = 0x06             ; Calibration
.equ RTC_CLKSEL_offset = 0x07            ; Clock Select
.equ RTC_CNT_offset = 0x08               ; Counter
.equ RTC_PER_offset = 0x0A               ; Period
.equ RTC_CMP_offset = 0x0C               ; Compare
.equ RTC_PITCTRLA_offset = 0x10          ; PIT Control A
.equ RTC_PITSTATUS_offset = 0x11         ; PIT Status
.equ RTC_PITINTCTRL_offset = 0x12        ; PIT Interrupt Control
.equ RTC_PITINTFLAGS_offset = 0x13       ; PIT Interrupt Flags
.equ RTC_PITDBGCTRL_offset = 0x15        ; PIT Debug control

;*************************************************************************
;** SIGROW - Signature row
;*************************************************************************
.equ SIGROW_DEVICEID0_offset = 0x00      ; Device ID Byte 0
.equ SIGROW_DEVICEID1_offset = 0x01      ; Device ID Byte 1
.equ SIGROW_DEVICEID2_offset = 0x02      ; Device ID Byte 2
.equ SIGROW_TEMPSENSE0_offset = 0x04     ; Temperature Calibration 0
.equ SIGROW_TEMPSENSE1_offset = 0x06     ; Temperature Calibration 1
.equ SIGROW_SERNUM0_offset = 0x10        ; LOTNUM0
.equ SIGROW_SERNUM1_offset = 0x11        ; LOTNUM1
.equ SIGROW_SERNUM2_offset = 0x12        ; LOTNUM2
.equ SIGROW_SERNUM3_offset = 0x13        ; LOTNUM3
.equ SIGROW_SERNUM4_offset = 0x14        ; LOTNUM4
.equ SIGROW_SERNUM5_offset = 0x15        ; LOTNUM5
.equ SIGROW_SERNUM6_offset = 0x16        ; RANDOM
.equ SIGROW_SERNUM7_offset = 0x17        ; SCRIBE
.equ SIGROW_SERNUM8_offset = 0x18        ; XPOS0
.equ SIGROW_SERNUM9_offset = 0x19        ; XPOS1
.equ SIGROW_SERNUM10_offset = 0x1A       ; YPOS0
.equ SIGROW_SERNUM11_offset = 0x1B       ; YPOS1
.equ SIGROW_SERNUM12_offset = 0x1C       ; RES0
.equ SIGROW_SERNUM13_offset = 0x1D       ; RES1
.equ SIGROW_SERNUM14_offset = 0x1E       ; RES2
.equ SIGROW_SERNUM15_offset = 0x1F       ; RES3

;*************************************************************************
;** SLPCTRL - Sleep Controller
;*************************************************************************
.equ SLPCTRL_CTRLA_offset = 0x00         ; Control A
.equ SLPCTRL_VREGCTRL_offset = 0x01      ; Control B

